app/Models/UserModel.php

    public function findByUsername(string $username)
    {
        return $this->where('username', trim($username))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Badger'
 LIMIT 1